kaiconcepts/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


jetfoiler_m0.name=Jetfoiler M0
jetfoiler_m0.vid.0=0x239A
jetfoiler_m0.pid.0=0x800B
jetfoiler_m0.vid.1=0x239A
jetfoiler_m0.pid.1=0x000B
jetfoiler_m0.upload.tool=bossac
jetfoiler_m0.upload.protocol=sam-ba
jetfoiler_m0.upload.maximum_size=262144
jetfoiler_m0.upload.offset=0x2000
jetfoiler_m0.upload.use_1200bps_touch=true
jetfoiler_m0.upload.wait_for_upload_port=true
jetfoiler_m0.upload.native_usb=true
jetfoiler_m0.build.mcu=cortex-m0plus
jetfoiler_m0.build.f_cpu=48000000L
jetfoiler_m0.build.usb_product="Jetfoiler M0"
jetfoiler_m0.build.usb_manufacturer="Jetfoiler"
jetfoiler_m0.build.board=SAMD_FEATHER_M0
jetfoiler_m0.build.core=arduino
jetfoiler_m0.build.extra_flags=-DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS  -DADAFRUIT_FEATHER_M0 -D__SAMD21G18A__ {build.usb_flags}
jetfoiler_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
jetfoiler_m0.build.openocdscript=openocd_scripts/arduino_zero.cfg
jetfoiler_m0.build.variant=jetfoiler_m0
jetfoiler_m0.build.variant_system_lib=
jetfoiler_m0.build.vid=0x239A
jetfoiler_m0.build.pid=0x800B
jetfoiler_m0.bootloader.tool=openocd
jetfoiler_m0.bootloader.file=zero/samd21_sam_ba.bin


jetfoiler_m0_v3Remote.name=Jetfoiler M0 v3 Remote
jetfoiler_m0_v3Remote.vid.0=0x239A
jetfoiler_m0_v3Remote.pid.0=0x800B
jetfoiler_m0_v3Remote.vid.1=0x239A
jetfoiler_m0_v3Remote.pid.1=0x000B
jetfoiler_m0_v3Remote.upload.tool=bossac
jetfoiler_m0_v3Remote.upload.protocol=sam-ba
jetfoiler_m0_v3Remote.upload.maximum_size=262144
jetfoiler_m0_v3Remote.upload.offset=0x2000
jetfoiler_m0_v3Remote.upload.use_1200bps_touch=true
jetfoiler_m0_v3Remote.upload.wait_for_upload_port=true
jetfoiler_m0_v3Remote.upload.native_usb=true
jetfoiler_m0_v3Remote.build.mcu=cortex-m0plus
jetfoiler_m0_v3Remote.build.f_cpu=48000000L
jetfoiler_m0_v3Remote.build.usb_product="Jetfoiler M0 v3 Remote"
jetfoiler_m0_v3Remote.build.usb_manufacturer="Jetfoiler"
jetfoiler_m0_v3Remote.build.board=SAMD_FEATHER_M0
jetfoiler_m0_v3Remote.build.core=arduino
jetfoiler_m0_v3Remote.build.extra_flags=-DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS  -DADAFRUIT_FEATHER_M0 -D__SAMD21G18A__ {build.usb_flags}
jetfoiler_m0_v3Remote.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
jetfoiler_m0_v3Remote.build.openocdscript=openocd_scripts/arduino_zero.cfg
jetfoiler_m0_v3Remote.build.variant=jetfoiler_m0_v3Remote
jetfoiler_m0_v3Remote.build.variant_system_lib=
jetfoiler_m0_v3Remote.build.vid=0x239A
jetfoiler_m0_v3Remote.build.pid=0x800B
jetfoiler_m0_v3Remote.bootloader.tool=openocd
jetfoiler_m0_v3Remote.bootloader.file=zero/samd21_sam_ba.bin